{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"feature_sequence","class_name":"InputLayer","config":{"batch_input_shape":[null,24,40],"dtype":"float32","sparse":false,"name":"feature_sequence"},"inbound_nodes":[]},{"name":"lstm_1","class_name":"LSTM","config":{"name":"lstm_1","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0.2,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["feature_sequence",0,0,{}]]]},{"name":"lstm_2","class_name":"LSTM","config":{"name":"lstm_2","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0.2,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["lstm_1",0,0,{}]]]},{"name":"attention_query","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"attention_query","trainable":true},"inbound_nodes":[[["lstm_2",0,0,{}]]]},{"name":"attention_key","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"attention_key","trainable":true},"inbound_nodes":[[["lstm_2",0,0,{}]]]},{"name":"attention_scores","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"attention_scores","trainable":true},"inbound_nodes":[[["attention_query",0,0,{}],["attention_key",0,0,{}]]]},{"name":"attention_weights","class_name":"Softmax","config":{"axis":-1,"name":"attention_weights","trainable":true},"inbound_nodes":[[["attention_scores",0,0,{}]]]},{"name":"attention_value","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"attention_value","trainable":true},"inbound_nodes":[[["lstm_2",0,0,{}]]]},{"name":"attention_output","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"attention_output","trainable":true},"inbound_nodes":[[["attention_weights",0,0,{}],["attention_value",0,0,{}]]]},{"name":"add_norm_1","class_name":"Add","config":{"name":"add_norm_1","trainable":true},"inbound_nodes":[[["lstm_2",0,0,{}],["attention_output",0,0,{}]]]},{"name":"ffn_1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"ffn_1","trainable":true},"inbound_nodes":[[["add_norm_1",0,0,{}]]]},{"name":"ffn_dropout","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"ffn_dropout","trainable":true},"inbound_nodes":[[["ffn_1",0,0,{}]]]},{"name":"ffn_2","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"ffn_2","trainable":true},"inbound_nodes":[[["ffn_dropout",0,0,{}]]]},{"name":"add_norm_2","class_name":"Add","config":{"name":"add_norm_2","trainable":true},"inbound_nodes":[[["add_norm_1",0,0,{}],["ffn_2",0,0,{}]]]},{"name":"global_avg_pool","class_name":"GlobalAveragePooling1D","config":{"name":"global_avg_pool","trainable":true},"inbound_nodes":[[["add_norm_2",0,0,{}]]]},{"name":"technical_branch","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"technical_branch","trainable":true},"inbound_nodes":[[["global_avg_pool",0,0,{}]]]},{"name":"social_branch","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"social_branch","trainable":true},"inbound_nodes":[[["global_avg_pool",0,0,{}]]]},{"name":"fundamental_branch","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"fundamental_branch","trainable":true},"inbound_nodes":[[["global_avg_pool",0,0,{}]]]},{"name":"astrological_branch","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"astrological_branch","trainable":true},"inbound_nodes":[[["global_avg_pool",0,0,{}]]]},{"name":"domain_concat","class_name":"Concatenate","config":{"axis":-1,"name":"domain_concat","trainable":true},"inbound_nodes":[[["technical_branch",0,0,{}],["social_branch",0,0,{}],["fundamental_branch",0,0,{}],["astrological_branch",0,0,{}]]]},{"name":"final_dense","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"final_dense","trainable":true},"inbound_nodes":[[["domain_concat",0,0,{}]]]},{"name":"final_dropout","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"final_dropout","trainable":true},"inbound_nodes":[[["final_dense",0,0,{}]]]},{"name":"classification_output","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"classification_output","trainable":true},"inbound_nodes":[[["final_dropout",0,0,{}]]]}],"input_layers":[["feature_sequence",0,0]],"output_layers":[["classification_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_1/kernel","shape":[40,512],"dtype":"float32"},{"name":"lstm_1/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_1/bias","shape":[512],"dtype":"float32"},{"name":"lstm_2/kernel","shape":[128,256],"dtype":"float32"},{"name":"lstm_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_2/bias","shape":[256],"dtype":"float32"},{"name":"attention_query/kernel","shape":[64,64],"dtype":"float32"},{"name":"attention_query/bias","shape":[64],"dtype":"float32"},{"name":"attention_key/kernel","shape":[64,64],"dtype":"float32"},{"name":"attention_key/bias","shape":[64],"dtype":"float32"},{"name":"attention_value/kernel","shape":[64,64],"dtype":"float32"},{"name":"attention_value/bias","shape":[64],"dtype":"float32"},{"name":"ffn_1/kernel","shape":[64,256],"dtype":"float32"},{"name":"ffn_1/bias","shape":[256],"dtype":"float32"},{"name":"ffn_2/kernel","shape":[256,64],"dtype":"float32"},{"name":"ffn_2/bias","shape":[64],"dtype":"float32"},{"name":"technical_branch/kernel","shape":[64,32],"dtype":"float32"},{"name":"technical_branch/bias","shape":[32],"dtype":"float32"},{"name":"social_branch/kernel","shape":[64,16],"dtype":"float32"},{"name":"social_branch/bias","shape":[16],"dtype":"float32"},{"name":"fundamental_branch/kernel","shape":[64,16],"dtype":"float32"},{"name":"fundamental_branch/bias","shape":[16],"dtype":"float32"},{"name":"astrological_branch/kernel","shape":[64,16],"dtype":"float32"},{"name":"astrological_branch/bias","shape":[16],"dtype":"float32"},{"name":"final_dense/kernel","shape":[80,64],"dtype":"float32"},{"name":"final_dense/bias","shape":[64],"dtype":"float32"},{"name":"classification_output/kernel","shape":[64,3],"dtype":"float32"},{"name":"classification_output/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}